% **********************************************************************
% Отображение поверхности сферы с точками заданной конфигурации на ней
% Выход:нет
% Вход:	x,y,z - координаты точек конфигурации
% **********************************************************************
function paint(x,y,z,r)
[X,Y,Z] = sphere;			% Отображение поверхности единичной сферы
surf(r.*X,r.*Y,r.*Z)
axis equal;

[row, col]=size(x);
hold on;
plot3(x,y,z,'or','markersize',20);	% Отображение точек
for i = 1 : row
 text(x(i), y(i), z(i), num2str(i),'Color','black');
end

hold off;
