% ----------------------------------------------------------------------------------------------    
% Вычисление радиуса через определитель Кэли-Менгера
% https://ru.wikipedia.org/wiki/Симплекс
% https://archive.org/details/jstor-2973351/page/n1/mode/2up
% ----------------------------------------------------------------------------------------------    
function R = circumscribedSphereRadius_Cayley_Menger(a, b, c, a1 , b1, c1)
    % У нас симплекс в 3-х мерном пространстве
    n = 3;
    k1 = (-1)^(n-1)/(2^n*factorial(n)^2);
    % Определитель Кэли — Менгера для объема
    CM = [
        0,  1,   1,   1,   1;
        1,  0,   a^2, b^2, c^2;
        1,  a^2, 0,   c1^2, b1^2;
        1,  b^2, c1^2, 0,   a1^2;
        1,  c^2, b1^2, a1^2, 0;
    ];
    
    % Вычисление объема
    V = sqrt(k1*det(CM));
    
    % Определитель T
    T = [
        0, a^2, b^2, c^2;
        a^2, 0, c1^2, b1^2;
        b^2, c1^2, 0, a1^2;
        c^2, b1^2, a1^2, 0;
    ];
    
    k2 = (-1)^(n)/(2^(n+1)*factorial(n)^2);
    % Вычисление радиуса описанной сферы
    R = sqrt(k2*det(T))/V;
end
